#language:ru
@trello
Функционал: Работа с доской Trello

  Сценарий: Редактирование доски Trello

    Пусть открыт url "https://trello.com/login"
    Когда инициализация страницы "Вход в Trello"
    #    Нужно ввести email вместо ****
    Тогда ввести в поле "почта" значение "****"
    Если кликнуть на элемент "atlassian"
    #    Нужно ввести email вместо ****
    Тогда ввести в поле "пароль" значение "****"
    Если кликнуть на элемент "войти"
    И подождать 2 сек
    Когда инициализация страницы "главная страница"
    Если кликнуть на элемент "доска KanbanTool"
    Когда инициализация страницы "открытая доска"
    Если кликнуть на элемент "карточка"
    И подождать 2 сек
    Когда удостовериться, что карточка находится "в колонке done"
    Когда удостовериться, что "пункт 'понять протокол http'" выполнен
    Когда удостовериться, что "пункт 'выучить методы запросов'" выполнен
    Если кликнуть на элемент "обложка"
    Если кликнуть на элемент "зеленый"
    Если кликнуть на элемент "в срок"
    Если кликнуть на элемент "закрыть"
    Если кликнуть на элемент "меню"
    И подождать 2 сек
    Если кликнуть на элемент "смена фона"
    Если кликнуть на элемент "цвета"
    Если кликнуть на элемент "цвет фона"
    Если кликнуть на элемент "приватность"
    Если кликнуть на элемент "рабочее пространство"
    И подождать 2 сек
    Если кликнуть на элемент "навигация слева"
    Если кликнуть на элемент "настройки"
    Когда инициализация страницы "страница настроек"
    Если кликнуть на элемент "изменить информацию"
    Тогда ввести в поле "название" значение "Ученики"
    И подождать 2 сек
    Если кликнуть на элемент "список типов"
    И подождать 2 сек
    Если кликнуть на элемент "образование"
    Если кликнуть на элемент "сохранить"
    И подождать 2 сек
    Если кликнуть на элемент "доска KanbanTool"
    И подождать 2 сек
    Когда инициализация страницы "открытая доска"
    Если кликнуть на элемент "название доски"
    Когда ввести в "изменить название" значение "Только для образования"
    И подождать 10 сек

















